be5invis.theme-verdandi
dbaeumer.vscode-eslint
eamodio.gitlens
jcbuisson.vue
karigari.chat
mauve.terraform
ms-azuretools.vscode-docker
ms-python.python
ms-vsliveshare.vsliveshare
ms-vsliveshare.vsliveshare-audio
ms-vsliveshare.vsliveshare-pack
tomoki1207.pdf
wix.vscode-import-cost