tap "beeftornado/rmtree"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "isen-ng/dotnet-sdk-versions"
tap "pulumi/tap"
tap "remotemobprogramming/brew"
tap "snyk/tap"
brew "python@3.12"
brew "awscli"
brew "bat"
brew "btop"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "grep"
brew "huggingface-cli"
brew "jenv"
brew "jq"
brew "mas"
brew "maven"
brew "openssl@1.1"
brew "protobuf"
brew "mysql@5.7"
brew "nmap"
brew "node"
brew "nvm"
brew "ollama"
brew "pkgconf"
brew "pyenv"
brew "python@3.11"
brew "ripgrep"
brew "rust"
brew "starship"
brew "tailwindcss"
brew "tenv"
brew "terraform-docs"
brew "tflint"
brew "tfsec"
brew "tig"
brew "wget"
brew "yt-dlp"
brew "zsh-autosuggestions"
brew "hashicorp/tap/packer"
brew "pulumi/tap/pulumi"
brew "remotemobprogramming/brew/mob"
brew "snyk/tap/snyk"
cask "1password"
cask "1password-cli"
cask "arc"
cask "aws-vault"
cask "brave-browser"
cask "dbeaver-community"
cask "discord"
cask "docker"
cask "dotnet-sdk3-1-100"
cask "drawio"
cask "figma"
cask "font-caskaydia-cove-nerd-font"
cask "google-chrome"
cask "intellij-idea-ce"
cask "iterm2"
cask "microsoft-auto-update"
cask "microsoft-outlook"
cask "microsoft-remote-desktop"
cask "microsoft-teams"
cask "miro"
cask "mysqlworkbench"
cask "obsidian"
cask "openvpn-connect"
cask "poedit"
cask "postman"
cask "proton-mail"
cask "proton-pass"
cask "raycast"
cask "slack"
cask "spotify"
cask "telegram"
cask "temurin@11"
cask "temurin@17"
cask "visual-studio-code"
cask "vlc"
cask "wkhtmltopdf"
cask "zed"
cask "zen-browser"
mas "eID-Signer", id: 1407740667
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft Excel", id: 462058435
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "The Unarchiver", id: 425424353
mas "Windows App", id: 1295203466
mas "Xcode", id: 497799835
mas "‎WhatsApp", id: 310633997
vscode "4ops.terraform"
vscode "a-h.templ"
vscode "amazonwebservices.amazon-q-vscode"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "bierner.lit-html"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.github-vscode-theme"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "k--kato.intellij-idea-keybindings"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vsliveshare.vsliveshare"
vscode "numso.prettier-standard-vscode"
vscode "orta.vscode-jest"
vscode "redhat.vscode-xml"
vscode "ryanolsonx.sandcastle-theme"
vscode "solidhelium.zed-theme"
vscode "yoavbls.pretty-ts-errors"
vscode "yzane.markdown-pdf"
