tap "beeftornado/rmtree"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "isen-ng/dotnet-sdk-versions"
tap "pulumi/tap"
tap "remotemobprogramming/brew"
tap "snyk/tap"
brew "python@3.11"
brew "awscli"
brew "bat"
brew "python@3.12"
brew "deno"
brew "ffmpeg"
brew "gh"
brew "git"
brew "git-quick-stats"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "grep"
brew "htop"
brew "jenv"
brew "jq"
brew "mas"
brew "maven"
brew "openssl@1.1"
brew "protobuf"
brew "mysql@5.7"
brew "nmap"
brew "node"
brew "nvm"
brew "ollama"
brew "pyenv"
brew "ripgrep"
brew "rust"
brew "starship"
brew "terraform-docs"
brew "tfenv"
brew "tflint"
brew "tfsec"
brew "tig"
brew "wget"
brew "yarn"
brew "yt-dlp"
brew "zsh-autosuggestions"
brew "hashicorp/tap/packer"
brew "pulumi/tap/pulumi"
brew "remotemobprogramming/brew/mob"
brew "snyk/tap/snyk"
cask "1password"
cask "arc"
cask "authy"
cask "aws-vault"
cask "brave-browser"
cask "dbeaver-community"
cask "discord"
cask "docker"
cask "dotnet-sdk3-1-100"
cask "drawio"
cask "font-caskaydia-cove-nerd-font"
cask "forticlient-vpn"
cask "google-chrome"
cask "intellij-idea-ce"
cask "iterm2"
cask "microsoft-auto-update"
cask "microsoft-outlook"
cask "microsoft-remote-desktop"
cask "microsoft-teams"
cask "miro"
cask "mysqlworkbench"
cask "obsidian"
cask "openvpn-connect"
cask "poedit"
cask "postman"
cask "raycast"
cask "robo-3t"
cask "slack"
cask "spotify"
cask "telegram"
cask "temurin11"
cask "temurin17"
cask "temurin8"
cask "visual-studio-code"
cask "vlc"
cask "wkhtmltopdf"
cask "zed"
mas "eID-Signer", id: 1407740667
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "bierner.lit-html"
vscode "biomejs.biome"
vscode "christian-kohler.npm-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.github-vscode-theme"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "k--kato.intellij-idea-keybindings"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vsliveshare.vsliveshare"
vscode "numso.prettier-standard-vscode"
vscode "orta.vscode-jest"
vscode "redhat.vscode-xml"
vscode "yoavbls.pretty-ts-errors"
